In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randint(0,100, size=(4,3))

In [3]:
data

array([[14, 59, 17],
       [ 3, 57, 72],
       [ 2, 67, 73],
       [99, 66, 28]])

In [4]:
df = pd.DataFrame(data)
df

    0   1   2
0  14  59  17
1   3  57  72
2   2  67  73
3  99  66  28

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
type(df[0])

pandas.core.series.Series

In [7]:
type(df[0][0])

numpy.int64

In [8]:
new_df = pd.DataFrame(data, index = ["Özay", "Melih", "Merve", "İlkim"], columns = ["Salary", "Age", "Seniority"])

In [9]:
new_df

       Salary  Age  Seniority
Özay       14   59         17
Melih       3   57         72
Merve       2   67         73
İlkim      99   66         28

In [10]:
new_df["Age"]

Özay     59
Melih    57
Merve    67
İlkim    66
Name: Age, dtype: int64

In [11]:
new_df[["Age", "Salary"]]

       Age  Salary
Özay    59      14
Melih   57       3
Merve   67       2
İlkim   66      99

In [12]:
new_df.loc["Özay"]

Salary       14
Age          59
Seniority    17
Name: Özay, dtype: int64

In [13]:
new_df.loc["Özay", "Salary"]     # Özay’ın Salary’si

np.int64(14)

In [14]:
new_df.loc[["Özay", "Merve"]]

       Salary  Age  Seniority
Özay       14   59         17
Merve       2   67         73

In [15]:
new_df.iloc[0]

Salary       14
Age          59
Seniority    17
Name: Özay, dtype: int64

In [16]:
new_df.iloc[:,1]

Özay     59
Melih    57
Merve    67
İlkim    66
Name: Age, dtype: int64

In [17]:
new_df.iloc[0, 0]  # Özay Salary

np.int64(14)

In [18]:
new_df.iloc[:, 0]   # Tüm Salary sütunu

Özay     14
Melih     3
Merve     2
İlkim    99
Name: Salary, dtype: int64

In [19]:
new_df.iloc[[0, 2]]     # Özay ve Merve

       Salary  Age  Seniority
Özay       14   59         17
Merve       2   67         73

In [20]:
new_df.iloc[0:2, 0:2]   # Özay & Melih → Salary ve Age

       Salary  Age
Özay       14   59
Melih       3   57

In [21]:
new_df["Extra"] = 10

In [22]:
new_df

       Salary  Age  Seniority  Extra
Özay       14   59         17     10
Melih       3   57         72     10
Merve       2   67         73     10
İlkim      99   66         28     10

In [23]:
new_df.drop("Extra", axis=1, inplace=True)

In [24]:
new_df

       Salary  Age  Seniority
Özay       14   59         17
Melih       3   57         72
Merve       2   67         73
İlkim      99   66         28

In [25]:
new_df["İlkim"] = 10
new_df

       Salary  Age  Seniority  İlkim
Özay       14   59         17     10
Melih       3   57         72     10
Merve       2   67         73     10
İlkim      99   66         28     10

In [26]:
new_df.drop("İlkim", inplace=True) # Axis vermezsen axis = 0 alır

In [27]:
new_df

       Salary  Age  Seniority  İlkim
Özay       14   59         17     10
Melih       3   57         72     10
Merve       2   67         73     10

In [28]:
new_df.loc["Özay", "Salary"] = 1000

In [29]:
new_df

       Salary  Age  Seniority  İlkim
Özay     1000   59         17     10
Melih       3   57         72     10
Merve       2   67         73     10

In [30]:
new_df[new_df > 50]

       Salary  Age  Seniority  İlkim
Özay   1000.0   59        NaN    NaN
Melih     NaN   57       72.0    NaN
Merve     NaN   67       73.0    NaN

In [31]:
new_df[new_df["Age"] > 65]

       Salary  Age  Seniority  İlkim
Merve       2   67         73     10

In [32]:
reset_df = new_df.reset_index()
reset_df

   index  Salary  Age  Seniority  İlkim
0   Özay    1000   59         17     10
1  Melih       3   57         72     10
2  Merve       2   67         73     10

In [33]:
reset_df = reset_df.rename(columns={"index":"Names"})
reset_df

   Names  Salary  Age  Seniority  İlkim
0   Özay    1000   59         17     10
1  Melih       3   57         72     10
2  Merve       2   67         73     10

In [41]:
new_indices = ["Öz", "Me", "Mer"]

In [44]:
reset_df["New Index"] = new_indices

In [45]:
reset_df.set_index("New Index", inplace=True)

In [46]:
reset_df

           Names  Salary  Age  Seniority  İlkim
New Index
Öz          Özay    1000   59         17     10
Me         Melih       3   57         72     10
Mer        Merve       2   67         73     10

In [48]:
reset_df.loc["Öz"]

Names        Özay
Salary       1000
Age            59
Seniority      17
İlkim          10
Name: Öz, dtype: object

In [49]:
# Multi index

In [50]:
firts_index = ["Simpson","Simpson","Simpson", "South Park", "South Park","South Park","South Park" ]

In [60]:
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [61]:
zipped_index = list(zip(firts_index, inner_index))

In [62]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [63]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [64]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [65]:
sample_values = np.ones((6,2))

In [66]:
big_df = pd.DataFrame(sample_values, index= zipped_index, columns=[["Age", "Salary"]])

In [67]:
big_df

                    Age Salary
Simpson    Homer    1.0    1.0
           Bart     1.0    1.0
           Marge    1.0    1.0
South Park Cartman  1.0    1.0
           Kenny    1.0    1.0
           Kyle     1.0    1.0